#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
module.vpc.aws_vpc.vpc_01: Refreshing state... [id=vpc-0e2cef2097fae75ba]
module.vpc.aws_subnet.subnet_01: Refreshing state... [id=subnet-047e1232b936e0898]
module.vpc.aws_subnet.subnet_02: Refreshing state... [id=subnet-064bba49d9a31e2b8]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.k8s.aws_eks_cluster.eks_01 will be created
  + resource "aws_eks_cluster" "eks_01" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "eks-01-dev"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags                  = {
          + "Name" = "eks-01-cluster-dev"
        }
      + tags_all              = {
          + "Name" = "eks-01-cluster-dev"
        }
      + version               = (known after apply)

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = [
              + "subnet-047e1232b936e0898",
              + "subnet-064bba49d9a31e2b8",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.k8s.aws_eks_node_group.eks_01_node_group_01 will be created
  + resource "aws_eks_node_group" "eks_01_node_group_01" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "eks-01-dev"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t2.micro",
          + "t3.micro",
          + "t3a.micro",
        ]
      + node_group_name        = "eks_01_node_group_dev"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-047e1232b936e0898",
          + "subnet-064bba49d9a31e2b8",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 1
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 2
        }
    }

  # module.k8s.aws_iam_role.iam_role_01 will be created
  + resource "aws_iam_role" "iam_role_01" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "iam-role-01-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.k8s.aws_iam_role_policy_attachment.role_01_eks_cluster_policy will be created
  + resource "aws_iam_role_policy_attachment" "role_01_eks_cluster_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "iam-role-01-dev"
    }

  # module.k8s.aws_iam_role_policy_attachment.role_01_eks_cni_policy will be created
  + resource "aws_iam_role_policy_attachment" "role_01_eks_cni_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "iam-role-01-dev"
    }

  # module.k8s.aws_iam_role_policy_attachment.role_01_eks_ec2_container_registry_readonly will be created
  + resource "aws_iam_role_policy_attachment" "role_01_eks_ec2_container_registry_readonly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "iam-role-01-dev"
    }

  # module.k8s.aws_iam_role_policy_attachment.role_01_eks_pods_resource_controller will be created
  + resource "aws_iam_role_policy_attachment" "role_01_eks_pods_resource_controller" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "iam-role-01-dev"
    }

  # module.k8s.aws_iam_role_policy_attachment.role_01_eks_worker_node_policy will be created
  + resource "aws_iam_role_policy_attachment" "role_01_eks_worker_node_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "iam-role-01-dev"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @tairov, Action: `pull_request`*